#### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
#1 : The read_csv() function
df = pd.read_csv("data_files/detailed_result.csv")

In [3]:
#2 : The head() function to display first n rows (by default 5) of a dataframe
df.head(3)

,District,Constituency No.,Constituency Name,Winner Candidate,Winner Party,Winner Votes,Winner %,Runner Up Candidate,Runner Up Party,Runner Up Votes,Runner Up %,Margin
0,Belagavi,1,Nippani,Shashikala Jolle,BJP,73348.0,39.14,Uttam Raosaheb Patil,NCP,66056,35.25,7292
1,Belagavi,2,Chikkodi-Sadalga,Ganesh Hukkeri,INC,128349.0,69.82,Ramesh Katti,BJP,49840,27.11,78509
2,Belagavi,3,Athani,Laxman Savadi,INC,131404.0,68.34,Mahesh Kumathalli,BJP,55282,28.75,76122

In [4]:
#3 : The describe() function which provides the key statistical data about the numerical columns of the data frame
df.describe()

,Constituency No.,Winner Votes,Winner %,Runner Up Votes,Runner Up %,Margin
count,224.000000,224.000000,224.000000,224.000000,224.000000,224.000000
mean,112.500000,86177.926174,49.559464,65535.334821,37.547098,20979.535714
std,64.807407,21869.826428,7.517976,17701.285185,6.964289,17872.183975
min,1.000000,95.463000,29.400000,20631.000000,11.080000,16.000000
25%,56.750000,73311.000000,45.110000,54130.750000,32.312500,7842.500000
50%,112.500000,84412.500000,49.585000,64380.000000,38.415000,15968.500000
75%,168.250000,94654.000000,53.837500,74074.750000,43.607500,30774.500000
max,224.000000,196220.000000,74.580000,154031.000000,47.850000,122392.000000

In [5]:
#4 : the Categorical() functions - It gives key analytics about a Column (series) 
pd.Categorical(df['Winner Party'])

['BJP', 'INC', 'INC', 'INC', 'INC', ..., 'INC', 'JD(S)', 'INC', 'INC', 'INC']
Length: 224
Categories (6, object): ['BJP', 'INC', 'Ind', 'JD(S)', 'KRPP', 'SKP']

In [6]:
#5 : The shape() function give the returns the shape of the datafram in Row X Columns
df.shape

(224, 12)

___

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
A = ['A', 'B', 'C', 'D', 'E']
B = [12,43,18,93,23]
C = [0.4, 0.3, 0.8, 0.9, 0.4]

df = pd.DataFrame({'A' : A, 'B' : B, 'C' : C})
df

   A   B    C
0  A  12  0.4
1  B  43  0.3
2  C  18  0.8
3  D  93  0.9
4  E  23  0.4

In [8]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
df.index = new_index
df

   A   B    C
1  A  12  0.4
3  B  43  0.3
5  C  18  0.8
7  D  93  0.9
9  E  23  0.4

___

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
#### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
#### calculate and print the sum of the first three values, which is 60.

In [10]:
def sum_first_n(series, n):
    sum = 0
    for num in series[0:n]:
        sum += num
    return sum

In [11]:
df = pd.DataFrame({'Values' : [10, 20, 30, 40, 50]})

result = sum_first_n(df['Values'],3)
print(result)

60

___

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [12]:
def word_count(text_col):
    word_count = [len(x.split(" ")) for x in text_col]
    return word_count

In [13]:
df = pd.DataFrame({'Text' : ['Twinkle Twinkle Little Start', 'Roses are red, sky is blue', 'When life gives you, lemons', 'Art of leaving']})
df.head()
df['Word Count'] = word_count(df['Text'])
df.head()

                           Text  Word Count
0  Twinkle Twinkle Little Start           4
1    Roses are red, sky is blue           6
2   When life gives you, lemons           5
3                Art of leaving           3

___

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

`size()` and `shape()` are both methods used to obtain information about the dimensions of a DataFrame or a Series. However, they provide different types of information:

1. `size()` returns the total number of elements in a DataFrame or a Series.
2. `size()` eturns a tuple that represents the dimensions of a DataFrame or a Series. 
    * For DataFrame it will return `(number of rows, number of columns)`.
    * For Series it will return `(number of rows,)`, indicating that it has only one dimension (a single column).

---

#### Q6. Which function of pandas do we use to read an excel file?

To read an *Excel file* in pandas, we can use the `read_excel()` function. This function allows us to read the contents of an Excel file and create a DataFrame from it.
The `read_excel()` function has many optional parameters that we can use to customize the import process, such as specifying sheet names, skipping rows, selecting specific columns, etc.

___

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
#### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [14]:
def extract_username(df):
    user_name = [x.split("@")[0] for x in df['Email']]
    df['Username'] = user_name

In [15]:
email_ids = ['kkshetty@india.com', 'info@pwskills.app', 'random_user@test.in', 'simple.email@email.com']
df = pd.DataFrame(email_ids, columns=['Email'])
df

                    Email
0      kkshetty@india.com
1       info@pwskills.app
2     random_user@test.in
3  simple.email@email.com

In [16]:
# Updates the df in place.
extract_username(df)
df

                    Email      Username
0      kkshetty@india.com      kkshetty
1       info@pwskills.app          info
2     random_user@test.in   random_user
3  simple.email@email.com  simple.email

___

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
#### For example, if df contains the following values:
####   A B C
#### 0 3 5 1
#### 1 8 2 7
#### 2 6 9 4
#### 3 2 3 5
#### 4 9 1 2
#### Your function should select the following rows: 
####   A B C
#### 1 8 2 7
#### 4 9 1 2
#### The function should return a new DataFrame that contains only the selected rows.

In [17]:
def filter_rows(df):
    df_filtered = df[(df['A'] > 5) & (df['B'] < 10)]
    return df_filtered

In [18]:
df = pd.DataFrame({
    'A' : [3, 8, 6, 2, 9],
    'B' : [5, 2, 9, 3, 1],
    'C' : [1, 7, 4, 5, 2]
})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [19]:
new_df = filter_rows(df)
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

___

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [20]:
def calculate_stats(series):
    mean = series.mean()
    median = series.median()
    std_dev = series.std()
    
    return(mean, median, std_dev)

In [21]:
my_values = pd.DataFrame({
    'Values' : [2,18,3,76,4,2,3,1,8,7,56,43,23,7,2,56,3,90,14]
})

mean, median, std_dev = calculate_stats(my_values['Values'])
print(f"Mean : {mean}")
print(f"Median : {median}")
print(f"Standard Deviation : {std_dev}")

Mean : 22.0
Median : 7.0
Standard Deviation : 27.956315128349008

___

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [22]:
def moving_average(series, window,**kwargs):
    if 'min_periods' in kwargs:
        ma_series = series.rolling(window, min_periods = kwargs['min_periods']).mean()
    else:
        ma_series = series.rolling(window).mean()
    return ma_series

In [23]:
sales_data = pd.read_csv("data_files/monthly_sales.csv")
print(sales_data.head())

''' To calculate moving average I'm suing rolling() function and setting the min_periods = 1 to start the moving average from day 1 itself. 
If not provided the moving average will be calculated from day 7
'''
sales_data['MovingAverage'] = moving_average(sales_data.Sales, 7, min_periods=1)
sales_data.head(10)

          Date   Sales
0  01-Jan-2023  185386
1  02-Jan-2023   64188
2  03-Jan-2023   30751
3  04-Jan-2023   23190
4  05-Jan-2023   72664

          Date   Sales  MovingAverage
0  01-Jan-2023  185386  185386.000000
1  02-Jan-2023   64188  124787.000000
2  03-Jan-2023   30751   93441.666667
3  04-Jan-2023   23190   75878.750000
4  05-Jan-2023   72664   75235.800000
5  06-Jan-2023   75283   75243.666667
6  07-Jan-2023  117166   81232.571429
7  08-Jan-2023  102393   69376.428571
8  09-Jan-2023   98429   74268.000000
9  10-Jan-2023  188081   96743.714286

___

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
#### For example, if df contains the following values:
####   Date
#### 0 2023-01-01
#### 1 2023-01-02
#### 2 2023-01-03
#### 3 2023-01-04
#### 4 2023-01-05
#### Your function should create the following DataFrame:
####   Date       Weekday
#### 0 2023-01-01 Sunday
#### 1 2023-01-02 Monday
#### 2 2023-01-03 Tuesday
#### 3 2023-01-04 Wednesday
#### 4 2023-01-05 Thursday
#### The function should return the modified DataFrame.

In [24]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 188 entries, 0 to 187
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           188 non-null    object
 1   Sales          188 non-null    int64
 2   MovingAverage  188 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 4.5+ KB

In [25]:
# I will first convert my Date column to date format
sales_data.Date = pd.to_datetime(sales_data.Date)
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 188 entries, 0 to 187
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           188 non-null    datetime64[ns]
 1   Sales          188 non-null    int64
 2   MovingAverage  188 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 4.5 KB

In [26]:
sales_data['Weekday'] = sales_data['Date'].dt.day_name()
sales_data

          Date   Sales  MovingAverage    Weekday
0   2023-01-01  185386  185386.000000     Sunday
1   2023-01-02   64188  124787.000000     Monday
2   2023-01-03   30751   93441.666667    Tuesday
3   2023-01-04   23190   75878.750000  Wednesday
4   2023-01-05   72664   75235.800000   Thursday
..         ...     ...            ...        ...
183 2023-07-03   78075  100315.428571     Monday
184 2023-07-04  168146  106020.000000    Tuesday
185 2023-07-05  126944  119195.142857  Wednesday
186 2023-07-06   71480  108031.714286   Thursday
187 2023-07-07   51143  105859.857143     Friday

[188 rows x 4 columns]

___

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [36]:
my_timestamps = pd.DataFrame({'Date' : ['2023-01-27 11:21:03', '2023-02-02 20:31:55', '2023-02-21 02:34:37', '2023-01-18 15:49:23', '2023-01-09 18:47:12', '2023-01-23 10:06:47', '2023-02-15 22:52:10', '2023-01-26 13:47:34', '2023-02-27 06:01:02', '2023-02-17 04:11:55']})

# Convert the date from type object to datetime format
my_timestamps.Date = pd.to_datetime(my_timestamps.Date)

#Filter the required rowa
my_timestamps[(my_timestamps.Date >= pd.to_datetime('2023-01-01')) & (my_timestamps.Date <= pd.to_datetime('2023-01-31'))]

                 Date
0 2023-01-27 11:21:03
3 2023-01-18 15:49:23
4 2023-01-09 18:47:12
5 2023-01-23 10:06:47
7 2023-01-26 13:47:34

___

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is **pandas** itself. 

```
import pandas as pd
```

---